src/cfe/Catalogs/ДействияИсполнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДействияИсполнения</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МоментРазыменованияУчастников</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МоментыРазыменованияУчастниковДействий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контролер</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Предмет</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПредметДействия</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Участники</Name>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Источники</Name>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Пункты</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/Enums/ВариантыВажностиОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВариантыВажностиОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Высокая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Обычная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Низкая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/Catalogs/ДействияИсполнения/Ext/ObjectModule.bsl
&ИзменениеИКонтроль("ЗаполнитьПоНастройке")
Процедура ЦППК_ЗаполнитьПоНастройке(Настройка, ПредметОбъект = Неопределено)

	Если Не ЗначениеЗаполнено(Настройка) Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(Настройка) <> Тип("СправочникСсылка.НастройкиДействийИсполнения") Тогда
		ВызватьИсключение СтрШаблон(
		НСтр("ru = 'Настройка типа ""%1"" не подходит для заполнения действия исполнения.
		|Следует актуализировать правила обработки документов.'"),
		ТипЗнч(Настройка));
	КонецЕсли;
	НастройкаДействия = Настройка;
	ПоПунктамНачальное = ПоПунктам;

	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Настройка,
	"Автор, Важность, ВариантИсполнения, ВидДействия, Участники, МоментРазыменованияУчастников,
	|ПодписыватьРезолюцииЭП, Контролер, ПоПунктам, ОтложенноеНачалоВыполнения");
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Реквизиты,, "Участники, Автор, Важность");
#Вставка
	// { *Андрей Анохин (ТТС) [28.03.2018]
	Если НЕ ЗначениеЗаполнено(Контролер) тогда 
		ТТС_КонтролерПоУмолчанию = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ТТС_КонтролерПоУмолчанию","ТТС_КонтролерПоУмолчанию");
		Если ЗначениеЗаполнено(ТТС_КонтролерПоУмолчанию) Тогда
			Контролер = ТТС_КонтролерПоУмолчанию;
		КонецЕсли;
	КонецЕсли;                        
	// }
#КонецВставки

	Если ЗначениеЗаполнено(Реквизиты.Автор) Тогда 
		Автор = Реквизиты.Автор;
	КонецЕсли;
	Если ЗначениеЗаполнено(Реквизиты.Важность) 
		И Реквизиты.Важность <> Перечисления.ВариантыВажностиОбъектов.Обычная Тогда 
		Важность = Реквизиты.Важность;
	КонецЕсли;

	Если ПредметОбъект = Неопределено
		И ЗначениеЗаполнено(Предмет) Тогда
		ПредметОбъект = Предмет.ПолучитьОбъект();
	КонецЕсли;

	// При переключении исполнения по пунктам, введенные руками пункты и исполнители должны быть удалены
	Если ПоПунктамНачальное <> ПоПунктам Тогда
		Участники.Очистить();
		Пункты.Очистить();
		Выгруженные = Участники.Выгрузить();
	Иначе
		Выгруженные = Участники.Выгрузить();
		Участники.Очистить();
	КонецЕсли;

	Источники.Очистить();

	// тут добавим только "Обрабатывающий результат"
	Для Каждого Выгруженный Из Выгруженные Цикл

		Если Выгруженный.ИзНастройки Тогда
			Продолжить;
		КонецЕсли;

		Если Выгруженный.ФункцияУчастника <> Перечисления.ФункцииУчастниковИсполнения.ОбрабатывающийРезультат Тогда
			Продолжить;
		КонецЕсли;

		Участник = Участники.Добавить();
		ЗаполнитьЗначенияСвойств(Участник, Выгруженный);
	КонецЦикла;

	РазыменоватьПриСозданииДействия = ДействияСервер.РазыменоватьПриСозданииДействия(МоментРазыменованияУчастников);
	ТаблицаУчастники = Реквизиты.Участники.Выгрузить();
	ТаблицаУчастники.Сортировать("НомерСтроки");
	Для Каждого ВыборкаУчастники Из ТаблицаУчастники Цикл

		ЕстьТакойУчастник = Ложь;
		Если ВыборкаУчастники.ФункцияУчастника <> Перечисления.ФункцииУчастниковИсполнения.ОбрабатывающийРезультат Тогда
			// Дубли ищем только внутри функции
			ЕстьУчастники = Участники.НайтиСтроки(Новый Структура("Участник, ФункцияУчастника, НаименованиеЗадачи, Описание",
			ВыборкаУчастники.Участник, ВыборкаУчастники.ФункцияУчастника,
			ВыборкаУчастники.НаименованиеЗадачи, ВыборкаУчастники.Описание));
			ЕстьТакойУчастник = Не ВыборкаУчастники.Защищенный 
			И (ЕстьУчастники.Количество() > 0);
		КонецЕсли;	

		Если Не ЕстьТакойУчастник Тогда

			// Проверим функцию ОбрабатывающийРезультат.
			// Если уже есть ОбрабатывающийРезультат - нового не добавляем
			Если ВыборкаУчастники.ФункцияУчастника = Перечисления.ФункцииУчастниковИсполнения.ОбрабатывающийРезультат 
				И УчастникОбрабатывающийРезультат().Количество() <> 0 Тогда
				Продолжить;
			КонецЕсли;	

			// Проверка условий.
			Если РазыменоватьПриСозданииДействия 
				И Не РаботаСАлгоритмамиПроверки.АлгоритмПоПредметуВыполняется(ПредметОбъект, ВыборкаУчастники.Условие) Тогда
				Продолжить;
			КонецЕсли;

			Участник = Участники.Добавить();
			ЗаполнитьЗначенияСвойств(Участник, ВыборкаУчастники);
			Участник.ИзНастройки = Истина;
			Участник.Идентификатор = Новый УникальныйИдентификатор;

		КонецЕсли;

	КонецЦикла;

	Для Каждого Выгруженный Из Выгруженные Цикл

		Если Выгруженный.ИзНастройки Тогда
			Продолжить;
		КонецЕсли;

		// "Обрабатывающий результат" добавили ранее, тут не добавляем
		Если Выгруженный.ФункцияУчастника = Перечисления.ФункцииУчастниковИсполнения.ОбрабатывающийРезультат Тогда
			Продолжить;
		КонецЕсли;

		Участник = Участники.Добавить();
		ЗаполнитьЗначенияСвойств(Участник, Выгруженный);
	КонецЦикла;

	Если РазыменоватьПриСозданииДействия Тогда 
		Разыменовать(ПредметОбъект,, Выгруженные);
	КонецЕсли;

КонецПроцедуры
